Revit 2027 API
BuiltInFailures.SketchFailures.BentFabricSheetManyLoopsInSketch Property
 The bend profile cannot contain two or more disconnected segments. Click Continue to correct the profile or Click Quit sketching to exit the bend profile editor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BentFabricSheetManyLoopsInSketch { get; }
Public Shared ReadOnly Property BentFabricSheetManyLoopsInSketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BentFabricSheetManyLoopsInSketch {
	FailureDefinitionId^ get ();
}
static member BentFabricSheetManyLoopsInSketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace